testdata/manual_exchange_refund.json

[
  [
    {
      "id": 1,
      "is_changeable": true,
      "service_class": "Y",
      "carrier_id": 1062,
      "fare": ".*",
      "destination": "ticket",
      "apply_strategy": "expensive",
      "fare_percent": null,
      "fare_percent_destination": null,
      "amount": 100,
      "currency": "RUB",
      "hours_before_departure": null,
      "penalty_strategy": "nearest_segment",
      "passenger_type": "full",
      "is_transit": null,
      "used_type": null,
      "departure_city_id": null,
      "arrival_city_id": null,
      "flight_type": "internal",
      "calculation_unit": null,
      "departure_country_id": null,
      "arrival_country_id": null,
      "max_exchange_count": null,
      "days_after_tariff_start": null,
      "tariff_start_type": null,
      "tariff_calculate_for": null,
      "segment_number_in_route": null,
      "segment_number_in_itinerary": null,
      "context": "exchange",
      "is_refundable": true,
      "brand": null,
      "issue_date_from": null,
      "issue_date_to": null,
      "departure_date_from": null,
      "departure_date_to": null
    },
    {
      "id": 2,
      "is_changeable": true,
      "service_class": "Y",
      "carrier_id": 1062,
      "fare": ".*",
      "destination": "ticket",
      "apply_strategy": "expensive",
      "fare_percent": null,
      "fare_percent_destination": null,
      "amount": 100,
      "currency": "RUB",
      "hours_before_departure": null,
      "penalty_strategy": "nearest_segment",
      "passenger_type": "child",
      "is_transit": null,
      "used_type": null,
      "departure_city_id": null,
      "arrival_city_id": null,
      "flight_type": "internal",
      "calculation_unit": null,
      "departure_country_id": null,
      "arrival_country_id": null,
      "max_exchange_count": null,
      "days_after_tariff_start": null,
      "tariff_start_type": null,
      "tariff_calculate_for": null,
      "segment_number_in_route": null,
      "segment_number_in_itinerary": null,
      "context": "exchange",
      "is_refundable": true,
      "brand": null,
      "issue_date_from": null,
      "issue_date_to": null,
      "departure_date_from": null,
      "departure_date_to": null
    }
  ]
]